{
    "projects": [
        {
            "id": 1,
            "name": "Elixir",
            "description": "Dans le cadre d’un projet de développement fullstack, j’ai conçu et développé une application web de A à Z, intégrant des fonctionnalités complètes pour les utilisateurs, les managers et les administrateurs.",
            "theme": "Développement web",
            "content": {
                "features": [
                    {
                        "title": "Pour les utilisateurs",
                        "details": [
                            "Consulter des cocktails avec des options de recherche, de filtrage et de tri.",
                            "Voir les bars à proximité proposant un cocktail spécifique.",
                            "Création et gestion d’un compte utilisateur (inscription, connexion).",
                            "Mise en favoris de cocktails préférés.",
                            "Notation des cocktails (de 1 à 5 étoiles).",
                            "Accès à des salons de discussion géolocalisés, basés sur les bars dans un rayon de 100 m.",
                            "Espace personnel pour modifier le pseudo, l’email, le mot de passe ou supprimer le compte."
                        ]
                    },
                    {
                        "title": "Pour les managers",
                        "details": [
                            "Création de cocktails.",
                            "Ajout de bars et de leurs salons de discussion associés.",
                            "Attribution de cocktails à leurs bars.",
                            "Accès à toutes les fonctionnalités des utilisateurs."
                        ]
                    },
                    {
                        "title": "Pour les administrateurs",
                        "details": [
                            "Création de comptes managers.",
                            "Suppression de comptes utilisateurs.",
                            "Accès à toutes les fonctionnalités des managers et des utilisateurs."
                        ]
                    }
                ]
            },
            "technologies": {
                "Backend": [
                    "API REST (niveau 2) développée avec Express.js",
                    "WebSocket configuré avec Node.js pour la communication bidirectionnelle en temps réel"
                ],
                "Frontend": [
                    "Vue.js pour l’interface utilisateur, avec intégration de WebSocket pour afficher les données en temps réel.",
                    "Utilisation de Leaflet pour la visualisation des données géolocalisées."
                ],
                "Database": [
                    "MongoDB, avec Mongoose pour gérer les interactions avec l’API REST."
                ]
            },
            "images": [
                "elixir.png"
            ],
            "competences": "Ce projet illustre ma maîtrise du développement backend, avec la création d'une API REST performante, et du développement frontend avec Vue.js, en intégrant des structures et des styles modernes pour une interface utilisateur intuitive."
        },
        {
            "id": 2,
            "name": "Explore Vaud",
            "description": "Dans le cadre du projet d’articulation de fin de 2ᵉ année d’ingénierie des médias, nous avons conçu et développé une application web dédiée à la découverte et à la gestion des sentiers culturels du Canton de Vaud.",
            "theme": "Développement web",
            "content": {
                "features": [
                    {
                        "title": "Pour les utilisateurs",
                        "details": [
                            "Une interface pour explorer des sentiers et découvrir des points d’intérêt culturels, avec possibilité de recherche, filtrage et tri.",
                            "Création et gestion d’un compte utilisateur (inscription, connexion)."
                        ]
                    },
                    {
                        "title": "Pour les institutions",
                        "details": [
                            "Un espace permettant d’ajouter et de gérer des sentiers et points d’intérêt (le compte d’institution doit être créé par les administrateurs sur demande)."
                        ]
                    }
                ]
            },
            "technologies": {
                "Backend": [
                    "Laravel (gestion complète du backend et des interactions avec la base de données)"
                ],
                "Frontend": [
                    "Vue.js (intégré avec Inertia.js)",
                    "Leaflet"
                ],
                "Database": [
                    "MySQL"
                ]
            },
            "role": {
                "Backend": [
                    "Conception et mise en place de toute la structure backend, incluant les diagrammes de classe (DC), schémas relationnels (SR) et migrations.",
                    "Gestion et création des bases de données avec Eloquent ORM (migrations, relations, modèles).",
                    "Développement des contrôleurs, middlewares, policies, logique métier et validations pour garantir une application robuste et performante.",
                    "Intégration avec Inertia.js pour relier le backend Laravel au frontend Vue.js."
                ],
                "Design": [
                    "Création du logo et choix des polices."
                ]
            },
            "images": [
                "explore-vaud.png"
            ],
            "competences": "Ce projet met en avant ma maîtrise du développement backend avec Laravel, ma gestion des bases de données avec MySQL, et ma capacité à collaborer sur des solutions esthétiques et fonctionnelles."
        },
        {
            "id": 3,
            "name": "Serial Vision",
            "description": "Dans le cadre d’un projet de data visualisation, nous avons conçu et développé un site web mettant en lumière les tueurs en série des USA à travers des visualisations interactives. Ce projet explore leur répartition géographique, leurs profils et leurs caractéristiques principales.",
            "theme": "Développement web",
            "content": {
                "features": [
                    {
                        "title": "Visualisations interactives",
                        "details": [
                            "Création de graphiques dynamiques et intuitifs (cartes, diagrammes, histogrammes, etc.) pour explorer les données sur les tueurs en série."
                        ]
                    },
                    {
                        "title": "Exploration des données",
                        "details": [
                            "Les utilisateurs peuvent filtrer les informations par critères tels que la région, le nombre de victimes ou la période d’activité."
                        ]
                    },
                    {
                        "title": "Données embarquées",
                        "details": [
                            "Les données au format JSON sont directement intégrées dans le frontend pour un fonctionnement rapide et autonome."
                        ]
                    }
                ]
            },
            "technologies": {
                "Frontend": [
                    "JavaScript : Pour la logique des visualisations et du routage.",
                    "HTML : Structure de l’application et intégration des visualisations.",
                    "CSS : Mise en page de base pour accompagner les fonctionnalités interactives.",
                    "D3.js : Création des visualisations interactives à partir des données JSON."
                ]
            },
            "roles": [
                {
                    "title": "Visualisations avec D3.js",
                    "details": [
                        "Conception et implémentation des visualisations interactives pour représenter les données de manière intuitive."
                    ]
                },
                {
                    "title": "Mise en place des données",
                    "details": [
                        "Intégration, organisation et utilisation des fichiers JSON directement dans le frontend."
                    ]
                },
                {
                    "title": "Routage",
                    "details": [
                        "Mise en place d’un système de navigation entre les différentes visualisations pour une expérience utilisateur fluide."
                    ]
                },
                {
                    "title": "Contributions globales",
                    "details": [
                        "J’ai réalisé l’ensemble des aspects techniques du projet, excepté le design des maquettes graphiques et le style  en CSS."
                    ]
                }
            ],
            "role": {
                "Visualisations avec D3.js": [
                    "Conception et implémentation des visualisations interactives pour représenter les données de manière intuitive."
                ],
                "Mise en place des données": [
                    "Intégration, organisation et utilisation des fichiers JSON directement dans le frontend."
                ],
                "Routage": [
                    "Mise en place d’un système de navigation entre les différentes visualisations pour une expérience utilisateur fluide."
                ],
                "Contributions globales": [
                    "J’ai réalisé l’ensemble des aspects techniques du projet, excepté le design des maquettes graphiques et le style avancé en CSS."
                ]
            },
            "images": [
                "serial-vision.png"
            ],
            "competences": "Ce projet illustre ma maîtrise de D3.js pour concevoir des visualisations interactives dynamiques, ainsi que mes compétences en développement frontend. J’ai intégré et structuré des datasets au format JSON directement dans le frontend, tout en assurant une navigation fluide grâce à un système de routage efficace."
        },        
        {
            "id": 4,
            "name": "Mobistyle",
            "description": "Pas bug v1 portfolio",
            "theme": "Wordpress",
            "images": [
                "mobistyle.jpg"
            ]
        },
        {
            "id": 5,
            "name": "Annuaire HEIG",
            "theme": "UX/UI",
            "description": "Pas bug v1 portfolio",
            "images": [
                "annuaire-heig.png"
            ]
        },
        {
            "id": 6,
            "theme": "Vente",
            "name": "Baby Bump",
            "description": "Pas bug v1 portfolio",
            "images": [
                "babybump.png"
            ]
        }
    ]
}